<!-- src/views/Reviews.vue -->
<template>
  <div>
    <Header />
    <TitleComponent
      titleText="Review"
      subText="빅리더 수료생들의 생생한 후기를 들어보세요."
    />
    <div class="container lg:w-8/12 mt-20">
      <swiper
        :modules="swiperModules"
        :slides-per-view="1"
        :space-between="0"
        :loop="true"
        :pagination="{ clickable: true }"
        :autoplay="{ delay: 10000, disableOnInteraction: false }"
        @swiper="onSwiper"
      >
        <swiper-slide v-for="reviewItem in reviewData" :key="reviewItem.id">
          <ReviewCard :review="reviewItem" />
        </swiper-slide>
      </swiper>
    </div>

    <div class="container lg:w-10/12 mt-10 mb-20">
      <swiper
        :modules="swiperModules"
        :slides-per-view="3"
        :space-between="16"
        :loop="true"
        :pagination="{ clickable: true }"
        :autoplay="{ delay: 2000, disableOnInteraction: false }"
        @swiper="onSwiper"
      >
        <swiper-slide v-for="videoItem in videoData" :key="videoItem.id">
          <ReviewVideoCard :video="videoItem" />
        </swiper-slide>
      </swiper>
    </div>
    <Footer />
  </div>
</template>

<script>
import Header from "@/components/layout/Header.vue"
import TitleComponent from "@/components/TitleComponent.vue"
import ReviewCard from "@/components/ReviewCard.vue"
import ReviewVideoCard from "@/components/ReviewVideoCard.vue"
import Footer from "@/components/layout/Footer.vue"

// Import Swiper core and required modules
import { Swiper, SwiperSlide } from "swiper/vue"
import {
  Navigation,
  Pagination,
  Scrollbar,
  Autoplay,
  A11y,
} from "swiper/modules"

export default {
  name: "Reviews",
  components: {
    Header,
    TitleComponent,
    ReviewCard,
    ReviewVideoCard,
    Footer,
    Swiper,
    SwiperSlide,
  },
  data() {
    return {
      reviewData: [
        {
          id: 1,
          name: "류성한",
          year: "빅리더 2기",
          imgSrc: require("@/assets/images/students/Ryu.jpg"),
          expertise: "Data Scientist",
          content:
            "저는 류성한이라고 하며, 현재 카드회사에서 Data Scientist로 3년째 근무하고 있습니다. 애플리케이션 추천 서비스를 담당한 후, 이제는 신사업 부문에서 일하고 있습니다.<br />빅리더 프로그램을 통한 스노볼 효과로 수상, 인턴, 그리고 현재 회사에 입사할 기회를 얻었습니다. 2018년에 빅리더와 함께 열정적으로 공부한 결과, 지금의 저에 이르렀습니다. 프로그램에서 가장 기억에 남는 것은 팀원들과 함께한 데이터 분석 프로젝트입니다. 기업 관계자들과 협력하여 과제를 수행하며, 어떤 분석 결과물이 그들에게 도움이 될지, 우리의 가설이 옳은지를 검증하는 과정이 매우 값진 경험이었습니다.<br /><br />데이터 분석이 자신의 길인지 고민하는 사람들에게 조언하자면, 몇 개월 동안 미친 듯이 열심히 공부해 보세요. 그 경험은 결코 배신하지 않을 것입니다.",
        },
        {
          id: 2,
          name: "인연준",
          year: "빅리더 2기",
          imgSrc: require("@/assets/images/students/Eunjoon_Lee.png"),
          expertise: "KAIST 석사과정",
          content:
            "<p>안녕하세요, 빅리더 2기 (2018년)에 활동한 인연준입니다. 현재 29세이며, KAIST에서 2023년 8월에 석사 학위를 받을 예정입니다. 제 연구 분야는 Robust Machine Learning, Graph Machine Learning, 그리고 Multimodal Representation Learning입니다.</p><p>군 복무 후 인공지능 관련 진로를 찾던 중, 학교 공지를 통해 빅리더 프로그램을 알게 되어 도전하게 되었습니다. 가장 인상 깊었던 것은 머신러닝/딥러닝 스터디였습니다. 교수님이 선정한 머신러닝의 바이블 같은 책을 공부하며, 학우들에게 직접 가르쳤습니다. 이 과정은 준비하는 데 많은 시간과 노력이 필요했지만, 효과적인 학습 방법이었다고 생각합니다.</p><p>빅리더 아카데미를 통해 자기주도적인 사람이 되었고, 원하는 일에 망설임 없이 도전할 수 있는 용기를 얻게 되었습니다. 가장 소중한 자산은 동료들입니다. 혼자서는 해낼 수 없는 일을 함께 해결하였고, 능력 있는 동료들을 보며 자극을 받아 더 열심히 공부하였습니다. 지금도 함께 성장한 동료들은 저에게 많은 자극과 새로운 인사이트를 제공합니다. 앞으로 빅리더 아카데미에 참여할 학생들이 좋은 동료들과 함께 멋진 성장을 이루길 바랍니다.</p>",
        },
        {
          id: 3,
          name: "홍아현",
          year: "빅리더 3기",
          imgSrc: require("@/assets/images/students/Hong_AhHyun.jpg"),
          expertise: "공공기관 연구원",
          content:
            "<p>안녕하세요, 2019년도 빅리더에 참가했던 96년생 홍아현입니다. 현재 공공기관에서 농생명 데이터 분석 직무를 맡고 있는 3년 차 연구원입니다. 저는 경영학 전공자로서, 미국 마케팅 회사에서 인턴 중에 코딩을 처음 접했습니다. 파이썬에 호기심을 느껴 한국으로 돌아온 후 코딩 공부를 시작하였고, 우연히 경남대학교에서 열리는 첫 빅리더 아카데미에 참여하여 데이터 분석 분야에 입문하게 되었습니다.</p><p>팀원들과 밤새 회의하고 운동장에서 산책한 기억이 아직도 생생합니다. 지금은 힘들었던 프로젝트보다는 그때의 열정적인 동료들이 떠올라 다시 돌아가고 싶다는 생각이 듭니다. 당시 탁월한 교수님들과 강사님들로부터 배운 지식과 인사이트는 현재 업무를 해결하는 데 큰 도움이 되었습니다. 아직 미숙하고 성장하는 과정이지만, 빅리더 아카데미와 전종식 교수님과의 시작을 항상 감사하게 생각합니다.</p><p>빅리더 아카데미에 참여하실 학생분들에게 조언 드리자면, 산업 분야를 가리지 않고 다양한 프로젝트를 경험해 보세요. 저는 현재 농업 분야에서 일하게될 줄 전혀 상상하지 못했습니다. 빅리더 아카데미를 수료한 후, 10개가 넘는 프로젝트를 진행하며 농생명 데이터 외에도 다양한 데이터를 다루었습니다. 산업군을 가리지 않고 다양한 데이터를 다루면서 해당 산업의 도메인 지식도 자연스럽게 습득되고 시야도 넓어집니다. 그러므로 아카데미에 열린 마음으로 임하는 것을 권장합니다. 지나고 보니, 비슷한 열정을 가진 동료들을 한 곳에서 만나기 쉽지 않다는 것을 깨달았습니다. 열정 넘치는 멋진 동료들과 올해 많은 추억을 쌓길 바랍니다! 화이팅!</p>",
        },
        {
          id: 4,
          name: "오환인",
          year: "빅리더 3기",
          imgSrc: require("@/assets/images/students/WhanIn_Oh.jpg"),
          expertise: "아주대 연구원",
          content:
            "<p>안녕하십니까, 아주대학교 산업공학과에 재학 중인 4학년 오환인입니다.</p><p>현재 저는 아주대학교의 PHM 관련 연구실에서 랩장으로 활동하며, 산학 프로젝트를 진행하고 있습니다. 또한, 데이터 분석에 관심 있는 학우들을 위해 멘토링을 진행하고 있습니다. 그리고 이러한 저의 열정과 성장의 원동력은, 바로 2022년에 참여했던 빅리더 아카데미에서의 경험에서 비롯된 것입니다.빅리더 아카데미의 프로젝트를 처음 접하게 된 것은 데이터 청년 캠퍼스 경기대학교에서의 교육과정을 거치면서였습니다. 빅리더 프로젝트의 선발 요건 중 하나는 창원에서 한 달 동안 생활이 가능한 것이었고, 이는 프로젝트에 대한 진지한 태도를 요구하는 것이었습니다. 그리고 그 요구에 저는 즉각적으로 동의했습니다. 프로젝트의 명확한 방향성과 구체적인 소개는 저에게 이 프로젝트를 통해 데이터 분석 능력이 크게 향상될 것이라는 확신을 주었습니다. 그래서 저는 부모님을 설득하고, 빅리더 아카데미에 참여하게 되었습니다. 빅리더 아카데미에서 진행한 현장 프로젝트는 저에게 귀중한 경험을 제공했습니다. 실무진과 함께 현장에서 발생하는 문제점을 해결하는 과정에서, 실질적인 업무 경험을 쌓을 수 있었습니다. 더욱이, 이런 경험을 통해 기업대표상과 특허를 얻는 등의 성과를 이뤄낼 수 있었습니다. 이러한 경험을 제공하는 곳이 빅리더 외에 어디에 있을까요? 저는 빅리더가 유일하다고 생각합니다. 빅리더를 통해 저는 문제에 대한 접근 방식과 데이터를 활용하는 태도에 변화가 생겼습니다. 100여 편의 논문을 철저히 분석하고, 그 내용을 구현하고 적용하는 과정을 거치면서 빠르게 성장하였습니다. 이 과정을 통해 저는 데이터에 대한 진정한 이해를 얻었고, 이를 토대로 현재까지 2편의 알고리즘 개발 관련 논문을 작성하고 발표하였으며, 여러 프로젝트에서 뛰어난 성과를 내고 있습니다.</p><p>제 페이스북 친구 중에는 전종식 교수님이 계시는데, 빅리더 관련 글이 올라올 때마다 저는 이를 학과에 공유하고 있습니다. 이는 빅리더가 단순히 학문적 지식을 쌓는 것이 아니라, 실질적인 성장을 이루는 데 있어 귀중한 프로그램이라는 것을 알기 때문입니다. 그리고 이러한 경험을 통해 저는 빅리더 프로젝트와 관련된 진로를 선택하였고, 여러분들에게도 빅리더 프로젝트가 진로 선택에 큰 도움이 될 것이라고 확신합니다. 여러분들이 빅리더 프로젝트에 참여하게 된다면, 그 과정은 흔치 않은 경험이 될 것입니다. 이는 단순히 프로젝트에 참여하는 것이 아니라, 본인의 진정한 성장을 위해 노력하는 과정이 될 것입니다. 프로젝트 기간 동안에는 프로젝트에 집중하고, 주체적으로 문제에 대해 생각하고, 해결책을 찾는 과정을 통해 빠르게 성장할 수 있습니다. 저는 당시 논문 100편 이상을 살펴보았지만, 여러분들에게는 200편 이상의 논문을 살펴보는 등의 도전을 권장합니다. 빅리더는 성장할 수 있는 환경을 제공하니, 여러분들은 그 안에서 열정적으로 성장하시기 바랍니다.</p>",
        },
        {
          id: 5,
          name: "조세연",
          year: "빅리더 3기",
          imgSrc: require("@/assets/images/students/Joseyeon_Cho.jpg"),
          expertise: "학생",
          content:
            "<p>안녕하세요! 조세연입니다. 현재는 다양한 프로젝트에 도전하면서 새로운 도전의 기회를 만끽하고 있습니다.</p><p>빅리더 아카데미를 경험하면서 스터디 카페에서의 공부는 제게 많은 추억을 남겨주었습니다. 어려운 수업 내용이 있을 때, 함께 공부하는 동기들과의 소통과 질문을 통해 지식을 쌓아나갔습니다. 이 경험은 혼자 공부할 때 느꼈을 법한 포기의 순간을 극복할 수 있게 해주었습니다. 함께 노력하고 성장하는 모습을 보며, 공부하는 것이 힘들더라도 즐겁게 할 수 있다는 것을 느낄 수 있었습니다. 빅리더 아카데미를 통해 얻은 또 다른 가치는 자신감입니다. 협업 프로젝트를 진행하면서 어려움을 겪기도 했지만, 팀원들과 함께 극복하며 프로젝트를 완성할 수 있었습니다. 그 결과, 현재 현장에서 사용 중인 서비스를 개발할 수 있었고, 이 경험을 통해 더 많은 도전에 도전하며 성장할 수 있는 자신감을 얻게 되었습니다.</p><p>짧은 기간이지만, 열심히 노력하고 도전한다면 많은 것을 얻을 수 있는 과정입니다. 함께 공부하고 성장하는 동료들과의 소통과 경험을 쌓는 과정에서, 새로운 도전에 대한 자신감과 열정을 얻을 수 있었습니다. 여러분도 빅리더 아카데미를 통해 함께 공동 성장할 수 있기를 기원합니다! 함께 파이팅해봅시다!</p>",
        },
        {
          id: 6,
          name: "최가영",
          year: "빅리더 3기",
          imgSrc: require("@/assets/images/students/Gaoung_choi.jpg"),
          expertise: "연구인턴",
          content:
            "<p>안녕하십니까, 경성대학교 4학년 재학중이면서 현재 국가수리과학연구소에서 연구인턴으로 재직중인 최가영입니다.</p><p>제 직업 준비 과정에서 가장 중요하다고 생각하는 것은 다양한 대외 활동 참여와 현장 경험입니다. 특히나, 이 둘을 통해 얻은 실질적인 경험이 면접에서 큰 장점으로 작용합니다. 빅리더 AI 프로그램은 이런 저의 생각을 완벽히 만족시키는 프로그램이었습니다. 빅리더에서는 저와 같은 이상과 목표를 가진 동료들을 만날 수 있었습니다. 동일한 공간에서 서로의 생각을 공유하고, 토론하며, 학습하는 과정에서 상호 시너지를 발휘할 수 있었습니다. 이런 경험은 빅리더 AI 프로젝트 이후에도 계속되었으며, 같은 동료들과 스터디를 함께하게 되었습니다. 실무 경험을 통해 공공기관 프로젝트 상을 받을 수 있었으며, 프로젝트 고도화 장학금과 장학증서까지 수여받을 수 있었습니다. 또한, 저희 팀은 한국산업단지공단에서 ESG 관련 기업 위기 모니터링 서비스를 개발하였습니다. 이 과정에서 기업들이 겪는 위기를 직접 파악하고, 그에 따른 해결책을 제시하였습니다. 이 서비스가 중소기업 벤처부에 인정받아 최우수기업 기관으로 선정되었던 경험은 면접에서의 저의 주요 어필 포인트가 되었습니다. 취업 준비에 있어서 공부와 함께 경제적인 부분을 고려해야 하는 상황이라면, 빅리더 AI를 강력히 추천드립니다. 이 프로그램은 풍부한 현장 경험을 제공하면서도, 매달 60만원의 장학금을 지급합니다. 이는 자기개발과 생활비를 함께 지원하는 중요한 장점입니다. 데이터 AI 분야에서는 실무 데이터를 통한 경험과 프로젝트 참여가 매우 중요합니다. 이러한 점에서 빅리더 AI는 우수한 기관과 함께하는 훌륭한 프로젝트를 제공합니다. 따라서, 저는 빅리더 AI를 강력추천드립니다. 이는 단순히 장학금의 재정적인 혜택뿐만 아니라, 현장에서의 의미 있는 경험과 네트워크 구축까지 가능하게 하는 프로그램이기 때문입니다.</p><p>빅리더 AI 프로그램은 이론적인 지식을 실제로 적용하는 훌륭한 기회를 제공합니다. 실질적인 프로젝트에 참여하면서, 이론과 실제 사이의 간극을 메울 수 있었습니다. 또한, 다양한 배경을 가진 동료들과 함께 협업하며 다양한 시각과 접근법을 배울 수 있었습니다. 이런 경험은 나중에 다양한 사람들과 팀을 이루어 일하게 될 현장에서 큰 도움이 될 것입니다. 또한, 프로그램을 통해 얻은 실질적인 성과는 면접시 매우 유리한 포인트가 될 것입니다. 프로젝트를 통해 얻은 경험과 성과를 구체적으로 이야기하며, 자신이 어떤 문제를 해결하고, 어떤 도전을 극복했는지를 보여줄 수 있습니다. 마지막으로, 빅리더 AI 프로그램은 독특하고 깊이 있는 학습 경험을 제공합니다. 데이터 과학, 인공지능, 프로젝트 관리 등 다양한 주제에 대해 심도 있게 배울 수 있습니다. 이러한 경험은 다양한 분야에서 활용 가능하며, 앞으로의 직업 생활에 있어서 큰 자산이 될 것입니다. 결국, 빅리더 AI 프로그램은 학습, 네트워킹, 경험, 그리고 재정적 지원까지 광범위하게 제공합니다. 이 모든 요소들이 합쳐져, 취업 준비를 하는 학생들에게 탁월한 플랫폼을 제공하며, 그들의 성공적인 미래를 위한 획기적인 발판을 마련해 줍니다.</p>",
        },
        {
          id: 7,
          name: "최은정",
          year: "빅리더 3기",
          imgSrc: require("@/assets/images/students/EunJeoun_choi.jpg"),
          expertise: "학생",
          content:
            '<p>안녕하세요, 저는 2022년 빅리더 프로그램에 참여하였던 최은정입니다.</p><p>저는 일본어와 정보통계학을 전공하며 덕성여자대학교에서 학문의 깊이를 추구했으며, 현재는 대학원 진학을 준비 중입니다. 빅리더 산학협력 프로젝트를 통해 세아창원특수강과 함께 "선재 표면품질 검사 솔루션 및 디지털 서비스화를 통한 불량 예측서비스"라는 주제로 프로젝트를 수행하였습니다. 이 투입한 노력과 열정은 기업대표상 수상으로 결실을 맺었고, 현재는 해당 프로젝트에 대한 특허를 출원 중에 있습니다. 저의 빅리더 참여는 통계학 교수님의 소개로 시작되었습니다. 교육이 서울이 아닌 경남에서 이루어진다는 점은 고려해야 할 부분이었지만, 실제 기업과 함께 산업 과제를 수행하는 빅리더의 독특한 매력에 끌려 참여하게 되었습니다. 물론, 통계학을 복수전공한 저로서는 전공에 대한 지식과 경험이 상대적으로 부족하다는 점이 부담스러웠습니다. 하지만 빅리더 프로젝트는 실무진과 직접 협업하며 현장에서의 문제를 다루는 경험을 제공하였고, 이를 실제 산업에 적용하는 목표를 가지고 있었습니다. 이 경험은 저를 더욱 성장시키는 계기가 되었으며, 팀원들과 함께 문제를 해결하는 과정에서 소중한 경험을 쌓을 수 있었습니다. 빅리더 프로그램은 저에게만의 터닝 포인트가 되었습니다. 저의 시야를 넓히고 문제를 바라보는 관점을 바꿔줬습니다. 또한, 산업 과제를 수행하는 동안 팀원들과 함께 밤낮으로 공부하고 분석하는 과정은 저의 학습 태도 자체를 변화시켰습니다.</p><p>저는 빅리더 프로그램을 강력하게 추천합니다. 이 프로그램은 교육과 프로젝트 기간 동안 완전히 집중할 수 있는 환경을 제공하며, 실제 산업에 바로 적용 가능한 과제를 수행하는 데 중점을 둡니다. 이런 경험은 빅리더만큼이나 매력적인 곳에서만 가능하다고 생각합니다. 열정을 찾는 방법 중 하나는 스스로 새로운 도전을 찾아 나서는 것입니다. 자신이 무엇에 열정을 느끼는지 알아보려면 새로운 환경에 노출되어 볼 필요가 있습니다. 비록 전공이 아니거나 문과 출신일지라도, 절대 두려워하지 말고 도전해 보시길 바랍니다. 빅리더 프로그램은 단순히 도움을 줄 뿐만 아니라, 그 이상의 경험을 제공합니다. 이 프로그램을 통해 팀원들과 함께 귀중한 경험을 쌓을 수 있기를 바랍니다. 여러분의 도전이 뜻깊은 성장의 발판이 되길 희망합니다.</p>',
        },
        {
          id: 8,
          name: "주세현",
          year: "빅리더 3기",
          imgSrc: require("@/assets/images/students/SaeHyun_Joo.jpg"),
          expertise: "학생",
          content:
            "<p>제 이름은 주세현이며, 현재 명지대학교 4학년에 재학 중입니다. 미래에는 금융권에 진출하고자 준비 중에 있습니다.</p><p> 2022년 빅리더에서 국립공원공단과 함께 '인공위성을 활용한 기후변화 분석 및 예측'이라는 흥미로운 프로젝트를 진행하였습니다. 이 프로젝트는 대상을 수상하였고, 공단 이사장상 및 데이터 청년 캠퍼스 장려상을 획득하는 영광까지 누릴 수 있었습니다. 데이터 분야에 깊이 빠져들고 싶은 학생들은, 저와 같은 우물 안의 개구리가 될 수밖에 없다고 느껴집니다. 공공 데이터를 제외하면 분석할 수 있는 데이터는 제한적이며, 각 분야의 전문지식도 부족하여 한계를 느끼는 것이 불가피합니다. 그러나 자신만의 무기를 갖추기 위해서는 현업에서 얻은 데이터를 전문가들과 함께 토론하고 분석하는 과정이 필수적입니다. 빅리더 프로젝트는 이러한 절실한 필요를 충족시켜주는 유일한 기회라고 생각되어, 망설임 없이 참여하게 되었습니다. 이 프로그램에서 가장 중요하게 생각하는 것은, 전국의 뛰어난 동료들과 함께하는 행복한 시간이었습니다. 물론 현장에서 직접 요구사항을 듣고, 이를 분석하며 프로젝트를 구체화시키는 과정은 큰 도전이었습니다. 그러나 팀원들과 함께 끈질기게 문제를 해결해나가며, 끝내 해결책을 찾아낸 그 순간의 쾌감은 잊을 수 없습니다. 상을 받는 순간도 매우 인상적이었지만, 그보다 더 가치있게 느껴진 것은 한 가지 문제에 몰입하여 끊임없이 고민하고 노력했던 그 순간들이었습니다.</p><p>\"천재는 노력하는 자를 이길 수 없고, 노력하는 자는 즐기는 자를 이길 수 없다\"라는 말이 있습니다. 빅리더를 통해 함께 노력하고, 그 과정을 즐길 수 있는 행복을 깨달았습니다. 또한, 노력의 결실이 달콤함을 맛보았으며, 그로 인해 어떤 어려움에 부딪혀도 결국에는 더 큰 즐거움이 기다리고 있다는 것을 알게 되었습니다. 이 경험은 저를 더 강인하고, 어떠한 상황에서도 미소를 지을 수 있는 사람으로 성장시켜 주었습니다. 빅리더 프로젝트를 강력히 추천하고 싶습니다. 이 프로그램은 대학생이 경험할 수 있는 최고의 활동 중 하나라고 자부합니다. 교육 과정은 도전적일 수 있지만, 그만큼 학생들의 성장을 위해 최선을 다하는 교수님들과 강사진이 함께합니다. 현업에서 사용되는 서비스의 전 과정을 기획부터 개발까지 경험할 수 있는 기회는 그 어떤 것과도 비교할 수 없습니다. 빅리더를 통해 이런 기회를 잡아보시길 바랍니다. 교육 기간 동안에는 모르는 것을 부끄러워하지 않고, 실패를 두려워하지 않기를 바랍니다. 교수님들이나 친구들에게 적극적으로 질문하고, 실패하더라도 그만큼 더 많은 것을 배울 수 있습니다. 프로젝트 기간 동안에는 왜 이 프로젝트가 필요한지, 무엇을 해결하려는지 항상 기억하는 것이 중요합니다. 이 목표들이 명확해질 때, 머신 러닝과 딥러닝 알고리즘을 도구로 적용해보는 것이 의미가 있습니다. 복잡한 알고리즘을 사용했다는 것이 취업에 반드시 유리한 것은 아니며, 방법론에만 집착하면 오히려 문제 해결에서 멀어질 수 있다는 것을 명심해야 합니다.</p>",
        },
        {
          id: 9,
          name: "심성보",
          year: "빅리더 3기",
          imgSrc: require("@/assets/images/students/SungBo_Shim.jpg"),
          expertise: "학생",
          content:
            "<p>삼육대학교 컴퓨터공학부에 재학 중인 심성보입니다. 지난 2022년, 저는 빅리더 프로그램에 참가하여 코트라와 협력하여 해외 관세청 고시 정보 분석 및 경보 서비스를 개발하는 명예를 얻었습니다.</p><p> 경남대학교에서 동기들과 함께 보낸 5주는 심히 가치 있는 시간이었습니다. 강의 종료 후에도 우리는 열심히 모여 서로의 지식을 보강하며, 서로 모르는 부분을 도움으로 채워나갔습니다. 현장 프로젝트는 실제 문제에 직면하는 과정이었으므로 많은 어려움이 있었지만, 이 경험이 나중의 취업 또는 대학원 입학에 있어 소중한 보탬이 될 것이라는 확신으로 팀원들과 함께 끝까지 노력했습니다. 그리고 이 과정에서 기업 대표상까지 수상하여 영광을 누리게 되었습니다.</p><p>빅리더 프로그램 참가 전까지는 인공지능 분야에 대한 강한 흥미가 없었으나, 프로그램 참가 후에는 데이터 사이언티스트로서의 역량을 발휘하고자 하는 새로운 목표를 세웠습니다. 전국의 다양한 인재들을 만나고, 서로 다른 생각을 가진 이들과 교류하며 공부할 수 있는 이 기회를 강력히 추천합니다. 이런 기회가 당신 앞에 찾아왔을 때, 아무리 어렵더라도 포기하지 말고, 노력을 통해 의미 있는 경험과 성과를 얻을 수 있기를 바라옵니다.</p>",
        },
        {
          id: 10,
          name: "문현석",
          year: "빅리더 3기",
          imgSrc: require("@/assets/images/students/HyunSeok_Moon.jpg"),
          expertise: "학생",
          content:
            '<p>안녕하세요, 창원대학교 전자공학과 4학년 문현석입니다.</p><p>2022년도에 빅리더 프로젝트에서 활동한 경험이 있으며, 현재 스마트팩토리 연구실에서 데이터 분석 작업을 수행하고 있습니다. 빅리더 프로젝트 기간 동안 저는 9명의 동료들과 함께 세아창원특수강에서 "압연 공정 센서 데이터를 활용한 불량 선재 예측" 프로젝트를 진행하였습니다. 빅리더 프로젝트가 제게 가장 큰 메리트로 다가온 것은, 데이터 분석에 관심 있는 동료들과 함께할 수 있다는 점이었습니다. 프로젝트 종료 후에도, 함께 스터디를 진행하며 서로 돕고 정보를 공유하고 있습니다. 또한, 현장 프로젝트는 회사 직원분들의 친절한 지원 덕분에 원활하게 진행되었고, 기관장 상을 수상할 기회까지 얻었습니다. 빅리더 프로젝트를 통해 경험과 인맥을 얻게 되어 큰 도움을 받았습니다. 이러한 경험을 통해, 다양한 도전에 대한 열정을 키울 수 있었습니다. 빅리더 프로젝트에 참여하기 전에는 단순히 공부에만 몰두했던 것 같습니다만, 프로젝트를 진행하며 기술력과 자신감을 키워 현재 다수의 프로젝트와 공모전에서 좋은 성과를 거두고 있습니다.</p><p>저와 같이 여러분들에게도 빅리더 프로젝트가 인생의 터닝 포인트가 되길 바랍니다. 빅리더 프로젝트에서는 단순히 데이터 분석 능력을 향상시키는 것뿐만 아니라, 다양한 분야의 전문가들의 경험과 취업 과정에서의 유용한 팁, 실무 경험 등을 얻을 수 있는 풍부한 정보를 제공합니다. 이런 정보를 잘 활용한다면 취업 과정에서도 큰 도움이 될 것입니다. 절대로 두려워하거나 주저하지 말고 도전해보세요. 만약 어려움에 부딪히게 된다면, 팀원이나 지도 교수님, 팀장님에게 도움을 청하시면 됩니다. 그들은 문제를 해결하는 데 필요한 모든 지원을 아끼지 않을 것입니다. 그 덕분에 저는 프로젝트 기간 동안 다른 것들을 모두 제쳐두고 프로젝트에만 전념하였습니다. 그 과정에서 밤을 새우며 회의를 하고 논문을 읽는 등, 빠르게 성장할 수 있었습니다. 결국, 빅리더 프로젝트는 저에게 인생의 중요한 전환점이었습니다. 여러분들에게도 빅리더가 인생의 터닝포인트가 될 수 있기를 바랍니다!</p>',
        },
        {
          id: 11,
          name: "김범수",
          year: "빅리더 3기",
          imgSrc: require("@/assets/images/students/Bumsu_Kim.jpeg"),
          expertise: "학생",
          content:
            "<p>안녕하십니까? 저는 경남대학교 4학년 김범수라고 합니다.</p><p>현재 인공지능 분야의 연구를 진행중이며, 2022년에는 세아창원특수강에서 '정밀 검사 효율화를 위한 선재 불량 예측 서비스'라는 주제로 프로젝트를 수행하였습니다.빅리더 프로그램의 처음 자기소개 시간에, 다른 참가자들에 비해 제 실력이 많이 부족하다고 느꼈습니다. 그러나 그들을 따라잡기 위해 학습 시간에는 아침 9시부터 밤 11시까지, 식사와 휴식 시간을 제외하고는 공부에만 집중했습니다. 그 후 현장 프로젝트를 수행하면서 기업의 실제 데이터를 분석하고, 현장의 전문가들과 함께 문제를 해결하는 경험을 통해 많은 것을 배울 수 있었습니다. 빅리더 프로그램의 처음 자기소개 시간에, 다른 참가자들에 비해 제 실력이 많이 부족하다고 느꼈습니다. 그러나 그들을 따라잡기 위해 학습 시간에는 아침 9시부터 밤 11시까지, 식사와 휴식 시간을 제외하고는 공부에만 집중했습니다. 그 후 현장 프로젝트를 수행하면서 기업의 실제 데이터를 분석하고, 현장의 전문가들과 함께 문제를 해결하는 경험을 통해 많은 것을 배울 수 있었습니다. 빅리더에서의 교육과 프로젝트 경험을 바탕으로, 저는 현재 연구실에 합류하게 되었고, 여러 데이터 분석 경진대회에서 수상하는 성과도 이루었습니다. 또한, 비슷한 꿈을 가진 동료들과 계속 연락을 주고받으며 정보를 공유하고 스터디를 진행하고 있습니다.</p><p>빅리더 프로그램은 제게 풍부한 학습과 좋은 추억을 선사했습니다. 그래서 저는 주변 친구들에게 빅리더 프로그램에 참여하도록 권유하고 있으며, 실제로 2023년 빅리더 프로그램에 친구가 참가하게 되었습니다. 빅리더에서 많은 것을 배우려면, 먼저 두려움을 떨쳐내야 합니다. 교육 기간 동안 저는 우수한 강사님들과 뛰어난 동료들을 만나게 되었습니다. 그들에게서 모르는 것을 배우며, 점차 자신감을 얻어갔습니다. 또한, 열정적으로 참여하는 것이 중요합니다. 특히 프로젝트 수행을 위해 다양한 논문을 읽고, 팀원들과 함께 노력했던 그 시간이 결국 좋은 결과를 만들어냈습니다. 빅리더를 통해 다양한 경험을 쌓고, 좋은 사람들을 만나는 것은 물론, 프로젝트를 성공적으로 완수하는 것까지 - 이 모든 것들이 저에게 큰 동력이 되었습니다. 그래서 여러분께도 빅리더 프로그램을 추천하고 싶습니다. 이 경험이 여러분의 삶에 긍정적인 변화를 가져다 줄 것이라 확신합니다. 마지막으로, 도전을 두려워하지 마시고, 교육생들, 교수님, 팀장님 등 여러분이 도움을 청할 수 있는 사람들에게 망설임 없이 도움을 청하시길 바랍니다. 그들의 도움을 받아 프로젝트를 수행하며, 저는 다른 모든 것을 잠시 뒤로하고 프로젝트에만 집중할 수 있었습니다. 그 결과 밤새 회의를 하며, 논문을 읽는 등의 경험을 통해 빠르게 성장할 수 있었습니다. 빅리더가 여러분의 삶에도 새로운 전환점이 되길 바랍니다.</p>",
        },
        // Add more review items as needed
      ],
      // 실제 데이터로 대체해야 합니다.
      videoData: [
        {
          id: 1,
          title: "지식이 남들보다 뒤쳐지는 상황에서!",
          year: "빅리더 9기",
          name: "공희배",
          vid: "Tr_uhyAi-Lw",
          link: "https://www.youtube.com/watch?v=Tr_uhyAi",
        },
        {
          id: 2,
          title: "흔치 않은 기회에요.",
          year: "빅리더 9기",
          name: "김예은",
          vid: "3IbVYqZ5vts",
          link: "https://www.youtube.com/watch?v=3IbVYqZ5vts",
        },
        {
          id: 3,
          title: "오직 프로젝트에 집중했어요!",
          year: "빅리더 9기",
          name: "문현석",
          vid: "V_dFzf2VtQM",
          link: "https://example.com/news1",
        },
        {
          id: 4,
          title: "면접에서 어필 할 수 있는 방법",
          year: "빅리더 9기",
          name: "최가영",
          vid: "Sv-IPnEU5AY",
          link: "https://www.youtube.com/watch?v=Tr_uhyAi",
        },
        {
          id: 5,
          title: "밤 낮으로 매진했어요",
          year: "빅리더 9기",
          name: "최은정",
          vid: "e6nPhvUgfF4",
          link: "https://www.youtube.com/watch?v=3IbVYqZ5vts",
        },
        {
          id: 6,
          title: "나만의 무기를 갖는 법",
          year: "빅리더 9기",
          name: "주세현",
          vid: "kP8fxMZFeGc",
          link: "https://example.com/news1",
        },
      ],
      swiperModules: [Navigation, Pagination, Scrollbar, Autoplay, A11y],
    }
  },
}
</script>
